/*
Задача 27: Напишите программу, которая принимает на вход число и выдаёт сумму цифр в числе.

452 -> 11

82 -> 10

9012 -> 12
*/

Console.Clear();


System.Console.Write("Введите любое натуральное число: ");
string a = "59";
int sum = 0;
System.Console.WriteLine(a);
System.Console.WriteLine(Convert.ToInt32(a[0]));
System.Console.WriteLine(a[1]);



